#include<iostream>
#include<Windows.h>

using namespace std;

// Реализовать простейший файловый менеджер с использованием ООП(классы, наследование и так далее).
// Файловый менеджер должен иметь такие возможности : показывать содержимое дисков; 
// создавать папки/файлы; удалять папки/файлы; переименовывать папки/файлы;
// копировать/переносить папки/файлы; вычислять размер папки/файла;
// производить поиск по маске(с поиском по подпапкам) и так далее.

int main()
{
	SetConsoleOutputCP(1251);




	return 0;
}